[Training]
SeraphVendor=The Seraph Crystal Vendor sells top level gear but only accepts Seraph Crystals in payment.<br><br>Earn more Seraph Crystals by slaying Seraph Guardians.
SeraphVendorTitle=The Seraph Crystal Vendor
RaidLockout=This boss is locked. One or more players have already killed this boss today.
RaidLockoutTitle=Boss Lockout
HealthAttrition=Players health will be temporarily reduced on each revive during this battle.
HealthAttritionTitle=Fear The Reaper